orgs/20200502SimpleMadeEasy.org
#+TITLE: Simple Made Easy
https://www.youtube.com/watch?v=oytL881p-nQ

This talk is about the difference between ease and simplicity. And about how to take the simple, and make it easy - close at hand.

#+begin_quote
Simplicity is prerequisite for reliability
---Edsger W. Dijkstra
#+end_quote

* The difference between Simple and Easy 
** The Origins of the words
 Simplex - one fold/braid.
 (vs. complex - to braid together)

 Ease - to lie near

** Simple means is about something being one thing - not being interleaved with another thing
 One role, task, concept, dimension. Not one /instance/, one /operation/. It's about lack of interleaving, not about cardinality

 Notice that Simplicity is objective, doesn't depend on your perspective

** Easy is about how close to us something is
 Construction 1: Literally close, its on our hard drive. In our tool box. Gem install

 Construction 2: Near to our understanding, /familiar/ to us

 Construction 3: Near our /capabilities/ - tough to talk about, an ego hit! But it's important to recognise we have limits.

 The juggling analogy: A beginner juggler can juggle 3 things. How many can an expert juggle? More for sure (the record is 11). But not 500. not 1000.

 Ease is /relative/ - near to what? Something near to / easy to you might not be easy to me

** Distinguish the tool, the construct, from the artifact (the program, system, the thing that has to run)
 to be changable, the Artifact has to be simple. The tools don't matter except to that extent

** To Complect - to interleave, entwine, braid, to make complex
   Don't do it!

   "where does the third strand end?"

   If you want to move forward you have to fix it (Even though it wasn't a 'mistake'). Disentangle

* You understanding something is making it easy - being close to it, being able to reason about it
** Why? Because you can't effectively change something you can't reason about
If you can't you can't change it. And the more simple something is, the more you can reason about it.

Inherent limits on our ability to reason about things do exist. We can only consider a few things at a time. If two things are intertwined, they by definition have to be considered together, and so you use up (exponentially with every thread) the space in your head.

Understanding is a prerequisite for Change - if you can't reason about it you can't make decisions about it

Having a great test suite isn't enough, it's your ability to understand your software. (If you haven't thought about a thing, you can't have written  test for it!)

Debugging - You can't lean on it too much. Bugs in production by definition passed the typechecker, passed all the tests.
    
** Moving your mind to it vs. moving it towards your mind
 Lets say you have this big thing you need make to easy, bring it close to you, understand

 To make it physically near, accessible, get it on your box! You then can learn about it. take some courses, read some books.

 (These two are up to you!)

 The 3rd thing? The capability? Pretty tricky. You can't move your mental capability by much. You can't become orders of magnitude smarter

 So you can't move your mind closer appreciably closer to the thing. You have to move the thing closer to your mind. You do this by making things simpler.

** How reasonable something is is a function of how simple it is. How much /you/ are able to reason about it is how easy it is (for /you/)
Obviously, you want something to be simple, so it takes less time for you and others to understand it (i.e. bring it close to them)

** Example 1: Parens in Lisp!
They are hard - they're not nearby, you're not familiar with them

Are they simple? NO. Not in CL/Scheme at least, because they use lists (with parens) for everything. One thing isn't simple? No becuase have to represent everything, they are overloaded with a lot of responsibility. Overloading is complexity. More than one thing is simpler than one thing in this case!

(This is a general principle - overloading one thing with multiple interpretations/responsibilities is introducing complexity)

This is why clojure introduced multiple paren types to reduce the overloading, make it simpler

** Programmers know the benefits of everything and the trade-offs of nothing.
 It's always 'Look, it has that...'. Never 'but in order to do that is has this'

* Beware: Easy is dangerous if it hides complexity! 
  Putting too much reliance on easy is not a good thing: You learn only by choosing the /unfamiliar/
  
