20200502SimpleMadeEasy.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-05-10 Sun 15:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Simple Made Easy</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Joe" />
</head>
<body>
<div id="content">
<h1 class="title">Simple Made Easy</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org465ea54">1. The difference between Simple and Easy</a>
<ul>
<li><a href="#orgd930993">1.1. The Origins of the words</a></li>
<li><a href="#org93c88a6">1.2. Simple means is about something being one thing - not being interleaved with another thing</a></li>
<li><a href="#orgea728be">1.3. Easy is about how close to us something is</a></li>
<li><a href="#org35d7e8a">1.4. Distinguish the tool, the construct, from the artifact (the program, system, the thing that has to run)</a></li>
<li><a href="#org28b9ba0">1.5. To Complect - to interleave, entwine, braid, to make complex</a></li>
</ul>
</li>
<li><a href="#orga6cab0e">2. You understanding something is making it easy - being close to it, being able to reason about it</a>
<ul>
<li><a href="#orgbf40d64">2.1. Why? Because you can't effectively change something you can't reason about</a></li>
<li><a href="#orgc29ce55">2.2. Moving your mind to it vs. moving it towards your mind</a></li>
<li><a href="#org8cc1701">2.3. How reasonable something is is a function of how simple it is. How much <i>you</i> are able to reason about it is how easy it is (for <i>you</i>)</a></li>
<li><a href="#org857d6b6">2.4. Example 1: Parens in Lisp!</a></li>
<li><a href="#orgdc8858d">2.5. Programmers know the benefits of everything and the trade-offs of nothing.</a></li>
</ul>
</li>
<li><a href="#orgfd3f63f">3. Beware: Easy is dangerous if it hides complexity!</a>
<ul>
<li><a href="#orge46d4b9">3.1. Easy things are often extremely complex, and chosing the easy-yet-complex thing is incidental complexity (i.e. it's your fault)</a></li>
<li><a href="#org33ffc44">3.2. Choosing the easy-yet-complex makes you fast-at-first.</a></li>
</ul>
</li>
<li><a href="#orgef04723">4. Making things simple - simple constructs, abstractions, composability, data as data</a>
<ul>
<li><a href="#orgfea491d">4.1. Benefits of simplicity - Lego castles vs. knitted castles</a></li>
<li><a href="#org1bce3fa">4.2. Constructs: Complex -&gt; Simple</a>
<ul>
<li><a href="#org051c687">4.2.1. Table</a></li>
</ul>
</li>
<li><a href="#orgefa16c1">4.3. Abstraction for simplicity - draw away the complexity</a></li>
<li><a href="#org8007443">4.4. Composability (not physical separation)</a></li>
<li><a href="#org9aef35c">4.5. State is NEVER simple.</a></li>
<li><a href="#org7013b70">4.6. Environmental complexity - we can't do anything about it</a></li>
<li><a href="#org98f0f58">4.7. Example 2: Lists and Order (complecting the thing with it's neighbour)</a></li>
<li><a href="#org27bab5a">4.8. Example 3: Data/Information is simple</a></li>
<li><a href="#org733c9e7">4.9. Simplify during analysis, modelling, waaaay before you implement</a></li>
</ul>
</li>
<li><a href="#org91c94a9">5. Simplicity is a choice</a></li>
</ul>
</div>
</div>
<p>
<a href="https://www.youtube.com/watch?v=oytL881p-nQ">https://www.youtube.com/watch?v=oytL881p-nQ</a>
</p>

<p>
This talk is about the difference between ease and simplicity. And about how to take the simple, and make it easy - close at hand.
</p>

<blockquote>
<p>
Simplicity is prerequisite for reliability
&#x2014;Edsger W. Dijkstra
</p>
</blockquote>

<div id="outline-container-org465ea54" class="outline-2">
<h2 id="org465ea54"><span class="section-number-2">1</span> The difference between Simple and Easy</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-orgd930993" class="outline-3">
<h3 id="orgd930993"><span class="section-number-3">1.1</span> The Origins of the words</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Simplex - one fold/braid.
(vs. complex - to braid together)
</p>

<p>
Ease - to lie near
</p>
</div>
</div>

<div id="outline-container-org93c88a6" class="outline-3">
<h3 id="org93c88a6"><span class="section-number-3">1.2</span> Simple means is about something being one thing - not being interleaved with another thing</h3>
<div class="outline-text-3" id="text-1-2">
<p>
One role, task, concept, dimension. Not one <i>instance</i>, one <i>operation</i>. It's about lack of interleaving, not about cardinality
</p>

<p>
Notice that Simplicity is objective, doesn't depend on your perspective
</p>
</div>
</div>

<div id="outline-container-orgea728be" class="outline-3">
<h3 id="orgea728be"><span class="section-number-3">1.3</span> Easy is about how close to us something is</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Construction 1: Literally close, its on our hard drive. In our tool box. Gem install
</p>

<p>
Construction 2: Near to our understanding, <i>familiar</i> to us
</p>

<p>
Construction 3: Near our <i>capabilities</i> - tough to talk about, an ego hit! But it's important to recognise we have limits.
</p>

<p>
The juggling analogy: A beginner juggler can juggle 3 things. How many can an expert juggle? More for sure (the record is 11). But not 500. not 1000.
</p>

<p>
Ease is <i>relative</i> - near to what? Something near to / easy to you might not be easy to me
</p>
</div>
</div>

<div id="outline-container-org35d7e8a" class="outline-3">
<h3 id="org35d7e8a"><span class="section-number-3">1.4</span> Distinguish the tool, the construct, from the artifact (the program, system, the thing that has to run)</h3>
<div class="outline-text-3" id="text-1-4">
<p>
to be changable, the Artifact has to be simple. The tools don't matter except to that extent
</p>
</div>
</div>

<div id="outline-container-org28b9ba0" class="outline-3">
<h3 id="org28b9ba0"><span class="section-number-3">1.5</span> To Complect - to interleave, entwine, braid, to make complex</h3>
<div class="outline-text-3" id="text-1-5">
<p>
Don't do it!
</p>

<p>
"where does the third strand end?"
</p>

<p>
If you want to move forward you have to fix it (Even though it wasn't a 'mistake'). Disentangle
</p>
</div>
</div>
</div>

<div id="outline-container-orga6cab0e" class="outline-2">
<h2 id="orga6cab0e"><span class="section-number-2">2</span> You understanding something is making it easy - being close to it, being able to reason about it</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgbf40d64" class="outline-3">
<h3 id="orgbf40d64"><span class="section-number-3">2.1</span> Why? Because you can't effectively change something you can't reason about</h3>
<div class="outline-text-3" id="text-2-1">
<p>
If you can't you can't change it. And the more simple something is, the more you can reason about it.
</p>

<p>
Inherent limits on our ability to reason about things do exist. We can only consider a few things at a time. If two things are intertwined, they by definition have to be considered together, and so you use up (exponentially with every thread) the space in your head.
</p>

<p>
Understanding is a prerequisite for Change - if you can't reason about it you can't make decisions about it
</p>

<p>
Having a great test suite isn't enough, it's your ability to understand your software. (If you haven't thought about a thing, you can't have written  test for it!)
</p>

<p>
Debugging - You can't lean on it too much. Bugs in production by definition passed the typechecker, passed all the tests.
</p>
</div>
</div>

<div id="outline-container-orgc29ce55" class="outline-3">
<h3 id="orgc29ce55"><span class="section-number-3">2.2</span> Moving your mind to it vs. moving it towards your mind</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Lets say you have this big thing you need make to easy, bring it close to you, understand
</p>

<p>
To make it physically near, accessible, get it on your box! You then can learn about it. take some courses, read some books.
</p>

<p>
(These two are up to you!)
</p>

<p>
The 3rd thing? The capability? Pretty tricky. You can't move your mental capability by much. You can't become orders of magnitude smarter
</p>

<p>
So you can't move your mind closer appreciably closer to the thing. You have to move the thing closer to your mind. You do this by making things simpler.
</p>
</div>
</div>

<div id="outline-container-org8cc1701" class="outline-3">
<h3 id="org8cc1701"><span class="section-number-3">2.3</span> How reasonable something is is a function of how simple it is. How much <i>you</i> are able to reason about it is how easy it is (for <i>you</i>)</h3>
<div class="outline-text-3" id="text-2-3">
<p>
Obviously, you want something to be simple, so it takes less time for you and others to understand it (i.e. bring it close to them)
</p>
</div>
</div>

<div id="outline-container-org857d6b6" class="outline-3">
<h3 id="org857d6b6"><span class="section-number-3">2.4</span> Example 1: Parens in Lisp!</h3>
<div class="outline-text-3" id="text-2-4">
<p>
They are hard - they're not nearby, you're not familiar with them
</p>

<p>
Are they simple? NO. Not in CL/Scheme at least, because they use lists (with parens) for everything. One thing isn't simple? No becuase have to represent everything, they are overloaded with a lot of responsibility. Overloading is complexity. More than one thing is simpler than one thing in this case!
</p>

<p>
(This is a general principle - overloading one thing with multiple interpretations/responsibilities is introducing complexity)
</p>

<p>
This is why clojure introduced multiple paren types to reduce the overloading, make it simpler
</p>
</div>
</div>

<div id="outline-container-orgdc8858d" class="outline-3">
<h3 id="orgdc8858d"><span class="section-number-3">2.5</span> Programmers know the benefits of everything and the trade-offs of nothing.</h3>
<div class="outline-text-3" id="text-2-5">
<p>
It's always 'Look, it has that&#x2026;'. Never 'but in order to do that is has this'
</p>
</div>
</div>
</div>

<div id="outline-container-orgfd3f63f" class="outline-2">
<h2 id="orgfd3f63f"><span class="section-number-2">3</span> Beware: Easy is dangerous if it hides complexity!</h2>
<div class="outline-text-2" id="text-3">
<p>
Putting too much reliance on easy is not a good thing: You learn only by choosing the <i>unfamiliar</i>
</p>
</div>
