orgs/20200502SimpleMadeEasy.org
** Easy things are often extremely complex, and chosing the easy-yet-complex thing is incidental complexity (i.e. it's your fault)
 Complex things can be familiar, available and easy to use. Assignment, x=5, is very easy, but the implications of x=5 in the middle of a block of code can be profound.
 
A Library you chose to pull in with =pip install= is easy to get and easy to use - but it can hide an enourmous amount of complexity.

 Any complexity that results from something you've decided to use is incidental (in the sense that it is /your fault/). 
   
** Choosing the easy-yet-complex makes you fast-at-first.
 Ignoring complexity will make you fast at first, and slow you down over the long term. Your artifact becomes a team member, the fungus slowly growing in the corner of the room, and over time it will dominant the decisions you can make

* Making things simple - simple constructs, abstractions, composability, data as data
** Benefits of simplicity - Lego castles vs. knitted castles
   Picture two castles, one made out of lego, and one knitted from yarn.

   The lego castle will be easier to reason about, and therefore change! More flexibilty - if you're not intertwined, you have architectural flexibility. Changing the policy, or moving subsystems
   
** Constructs: Complex -> Simple
 + State/Objects -> Values
 + Methods -> Functions, namespaces
 + Syntax -> Data
 + Inheritance, switch, matching -> Polymorphism a la carte
 + variables -> Managed Refs
 + Imperative loops, fold -> set functions
 + Actors -> Queues
 + ORM -> Declarative data manipulation
 + conditions -> tiles
 + inconsistency -> consistency

*** Table
    
 | Construct       | Complects                      |
 |-----------------+--------------------------------|
 | State           | Everyhing it touches           |
 | Objects         | State, identity, value         |
 | Methods         | Function and state, namespaces |
 | Syntax          | Meaning, order                 |
 | Inheritance     | types                          |
 | switch/matching | Multiple who/what pairs        |
 | variables       | value, time                    |
 | loops/fold      | what/how                       |
 | actors          | what/who                       |
 | ORM             | OMG                            |
 | Conditionals    | why, rest of the program       |


 | Construct                     | Got by                        |
 |-------------------------------+-------------------------------|
 | Values                        | final, persistent collections |
 | Functions                     | stateless methods             |
 | namespaces                    | language support              |
 | data                          | maps, arrays, sets, xml, json |
 | polymorphism a la carte       | protocols, type classes       |
 | managed refs                  | clojure/haskell refs          |
 | set functions                 | libraries                     |
 | queues                        | libraries                     |
 | declarative data manipulation | SQL/LINQ/Datalog              |
 | Rules                         | Libraries, prolog             |
 | consistency                   | Transactions/values           |

** Abstraction for simplicity - draw away the complexity
 Abstract means to draw away

 There are maybe dangers from overabstracting (IFactoryResourceManager)

 Abstracting to simplify is different from abstracting as hiding /complexity/. 

 I don't know, I don't want to know. I want to be able to use your thing without knowing it
   
** Composability (not physical separation)
   Compose - to place together. Like legos. Composing simple components leads to robust software

   OK, we know its not that straight forward. Modularity, just having two pieces of code sitting in their own modules (physically separated), they can still be deeply completed with eachother. Physical separation is a consequence of simplicity, not a guaranteed result of it.

** State is NEVER simple. 
   There is no way to uncomplect. It inherantly complects value and time. It complects everything it touches!

   Be really scared of it. Label it. Make it explicit. Quarantine it on it's own

   Your language can help you by having explicit refs/vars that compose value and time, i.e. make them distinct. Doesn't decomplect it to.

** Environmental complexity - we can't do anything about it
   Resources, CPU, memory

 No good way to solve without introducing inefficiency!

 Individual policies don't compose well - individual decisions don't combine to make good outcomes

** Example 2: Lists and Order (complecting the thing with it's neighbour)
 Every time you have a list you need to ask: Does order matter?

 If I have =[depth width height]= <- I'm going to forget the order!

 Use sets, because they advertise that they are orderless

 Why care about order? Complects each thing with the next, infects usage points, inhibit change. =[name email] -> [name phone email]= is breaking!

 Order is Baked into a ton of things!
 + Positional args -> named args, map
 + Syntax -> data
 + product types -> associative records
 + imperative programs -> declarative programs
 + prolog -> datalog
 + call chains -> queues
 + xml -> JSON, EDN

 (not saying don't use them - just be aware you are introducing complexity, be aware of the trade offs)

 MAPS! USE MAPS! Make them powerful, make them idiomatic.
   
