20200502SimpleMadeEasy.html

<div id="outline-container-orge46d4b9" class="outline-3">
<h3 id="orge46d4b9"><span class="section-number-3">3.1</span> Easy things are often extremely complex, and chosing the easy-yet-complex thing is incidental complexity (i.e. it's your fault)</h3>
<div class="outline-text-3" id="text-3-1">
<p>
Complex things can be familiar, available and easy to use. Assignment, x=5, is very easy, but the implications of x=5 in the middle of a block of code can be profound.
</p>

<p>
A Library you chose to pull in with <code>pip install</code> is easy to get and easy to use - but it can hide an enourmous amount of complexity.
</p>

<p>
Any complexity that results from something you've decided to use is incidental (in the sense that it is <i>your fault</i>). 
</p>
</div>
</div>

<div id="outline-container-org33ffc44" class="outline-3">
<h3 id="org33ffc44"><span class="section-number-3">3.2</span> Choosing the easy-yet-complex makes you fast-at-first.</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Ignoring complexity will make you fast at first, and slow you down over the long term. Your artifact becomes a team member, the fungus slowly growing in the corner of the room, and over time it will dominant the decisions you can make
</p>
</div>
</div>
</div>

<div id="outline-container-orgef04723" class="outline-2">
<h2 id="orgef04723"><span class="section-number-2">4</span> Making things simple - simple constructs, abstractions, composability, data as data</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-orgfea491d" class="outline-3">
<h3 id="orgfea491d"><span class="section-number-3">4.1</span> Benefits of simplicity - Lego castles vs. knitted castles</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Picture two castles, one made out of lego, and one knitted from yarn.
</p>

<p>
The lego castle will be easier to reason about, and therefore change! More flexibilty - if you're not intertwined, you have architectural flexibility. Changing the policy, or moving subsystems
</p>
</div>
</div>

<div id="outline-container-org1bce3fa" class="outline-3">
<h3 id="org1bce3fa"><span class="section-number-3">4.2</span> Constructs: Complex -&gt; Simple</h3>
<div class="outline-text-3" id="text-4-2">
<ul class="org-ul">
<li>State/Objects -&gt; Values</li>
<li>Methods -&gt; Functions, namespaces</li>
<li>Syntax -&gt; Data</li>
<li>Inheritance, switch, matching -&gt; Polymorphism a la carte</li>
<li>variables -&gt; Managed Refs</li>
<li>Imperative loops, fold -&gt; set functions</li>
<li>Actors -&gt; Queues</li>
<li>ORM -&gt; Declarative data manipulation</li>
<li>conditions -&gt; tiles</li>
<li>inconsistency -&gt; consistency</li>
</ul>
</div>

<div id="outline-container-org051c687" class="outline-4">
<h4 id="org051c687"><span class="section-number-4">4.2.1</span> Table</h4>
<div class="outline-text-4" id="text-4-2-1">
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Construct</th>
<th scope="col" class="org-left">Complects</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">State</td>
<td class="org-left">Everyhing it touches</td>
</tr>

<tr>
<td class="org-left">Objects</td>
<td class="org-left">State, identity, value</td>
</tr>

<tr>
<td class="org-left">Methods</td>
<td class="org-left">Function and state, namespaces</td>
</tr>

<tr>
<td class="org-left">Syntax</td>
<td class="org-left">Meaning, order</td>
</tr>

<tr>
<td class="org-left">Inheritance</td>
<td class="org-left">types</td>
</tr>

<tr>
<td class="org-left">switch/matching</td>
<td class="org-left">Multiple who/what pairs</td>
</tr>

<tr>
<td class="org-left">variables</td>
<td class="org-left">value, time</td>
</tr>

<tr>
<td class="org-left">loops/fold</td>
<td class="org-left">what/how</td>
</tr>

<tr>
<td class="org-left">actors</td>
<td class="org-left">what/who</td>
</tr>

<tr>
<td class="org-left">ORM</td>
<td class="org-left">OMG</td>
</tr>

<tr>
<td class="org-left">Conditionals</td>
<td class="org-left">why, rest of the program</td>
</tr>
</tbody>
</table>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Construct</th>
<th scope="col" class="org-left">Got by</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">Values</td>
<td class="org-left">final, persistent collections</td>
</tr>

<tr>
<td class="org-left">Functions</td>
<td class="org-left">stateless methods</td>
</tr>

<tr>
<td class="org-left">namespaces</td>
<td class="org-left">language support</td>
</tr>

<tr>
<td class="org-left">data</td>
<td class="org-left">maps, arrays, sets, xml, json</td>
</tr>

<tr>
<td class="org-left">polymorphism a la carte</td>
<td class="org-left">protocols, type classes</td>
</tr>

<tr>
<td class="org-left">managed refs</td>
<td class="org-left">clojure/haskell refs</td>
</tr>

<tr>
<td class="org-left">set functions</td>
<td class="org-left">libraries</td>
</tr>

<tr>
<td class="org-left">queues</td>
<td class="org-left">libraries</td>
</tr>

<tr>
<td class="org-left">declarative data manipulation</td>
<td class="org-left">SQL/LINQ/Datalog</td>
</tr>

<tr>
<td class="org-left">Rules</td>
<td class="org-left">Libraries, prolog</td>
</tr>

<tr>
<td class="org-left">consistency</td>
<td class="org-left">Transactions/values</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>

<div id="outline-container-orgefa16c1" class="outline-3">
<h3 id="orgefa16c1"><span class="section-number-3">4.3</span> Abstraction for simplicity - draw away the complexity</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Abstract means to draw away
</p>

<p>
There are maybe dangers from overabstracting (IFactoryResourceManager)
</p>

<p>
Abstracting to simplify is different from abstracting as hiding <i>complexity</i>. 
</p>

<p>
I don't know, I don't want to know. I want to be able to use your thing without knowing it
</p>
</div>
</div>

<div id="outline-container-org8007443" class="outline-3">
<h3 id="org8007443"><span class="section-number-3">4.4</span> Composability (not physical separation)</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Compose - to place together. Like legos. Composing simple components leads to robust software
</p>

<p>
OK, we know its not that straight forward. Modularity, just having two pieces of code sitting in their own modules (physically separated), they can still be deeply completed with eachother. Physical separation is a consequence of simplicity, not a guaranteed result of it.
</p>
</div>
</div>

<div id="outline-container-org9aef35c" class="outline-3">
<h3 id="org9aef35c"><span class="section-number-3">4.5</span> State is NEVER simple.</h3>
<div class="outline-text-3" id="text-4-5">
<p>
There is no way to uncomplect. It inherantly complects value and time. It complects everything it touches!
</p>

<p>
Be really scared of it. Label it. Make it explicit. Quarantine it on it's own
</p>

<p>
Your language can help you by having explicit refs/vars that compose value and time, i.e. make them distinct. Doesn't decomplect it to.
</p>
</div>
</div>

<div id="outline-container-org7013b70" class="outline-3">
<h3 id="org7013b70"><span class="section-number-3">4.6</span> Environmental complexity - we can't do anything about it</h3>
<div class="outline-text-3" id="text-4-6">
<p>
Resources, CPU, memory
</p>

<p>
No good way to solve without introducing inefficiency!
</p>

<p>
Individual policies don't compose well - individual decisions don't combine to make good outcomes
</p>
</div>
</div>

<div id="outline-container-org98f0f58" class="outline-3">
<h3 id="org98f0f58"><span class="section-number-3">4.7</span> Example 2: Lists and Order (complecting the thing with it's neighbour)</h3>
<div class="outline-text-3" id="text-4-7">
<p>
Every time you have a list you need to ask: Does order matter?
</p>

<p>
If I have <code>[depth width height]</code> &lt;- I'm going to forget the order!
</p>

<p>
Use sets, because they advertise that they are orderless
</p>

<p>
Why care about order? Complects each thing with the next, infects usage points, inhibit change. <code>[name email] -&gt; [name phone email]</code> is breaking!
</p>

<p>
Order is Baked into a ton of things!
</p>
<ul class="org-ul">
<li>Positional args -&gt; named args, map</li>
<li>Syntax -&gt; data</li>
<li>product types -&gt; associative records</li>
<li>imperative programs -&gt; declarative programs</li>
<li>prolog -&gt; datalog</li>
<li>call chains -&gt; queues</li>
<li>xml -&gt; JSON, EDN</li>
</ul>

<p>
(not saying don't use them - just be aware you are introducing complexity, be aware of the trade offs)
</p>

<p>
MAPS! USE MAPS! Make them powerful, make them idiomatic.
</p>
</div>
</div>
