orgs/20200502SimpleMadeEasy.org
** Example 3: Data/Information is simple
 There isn't a problem with information. Information is simple. But we make it a problem! We hide it behind a micro language - a class. You make a Box class and you have to invent a whole language to manipulate boxes.

 Start representing data as data

 When we use classes we think we are encapsulating. Encapsulation is about hiding implementation detail. But information doesn't have implementation, it's just data. There is no innards of information. You added it. Why?

 The information /will/ eventually have representation - you don't get around that by wrapping it in a class, at some point someone is going to want to see the information a class contains.

 The litmus test - can you move it?

 Subsystems must have
 + well defined boundaries
 + absstracted operaitnal interface (verbs)
 + general error handling (checked exceptions are a terrible terrible idea)
 + take/return data (not IPersonInfo). Do this inside and outside systems
 
** Simplify during analysis, modelling, waaaay before you implement
* Simplicity is a choice
Nothing manfactures simplicity. It's a decision making process, and you have to do it over and over again, get better at it. Develop 'entanglement' intuition

Don't overestimate your reliability tools: they don't check for simplicity
   
