20200502SimpleMadeEasy.html

<div id="outline-container-org27bab5a" class="outline-3">
<h3 id="org27bab5a"><span class="section-number-3">4.8</span> Example 3: Data/Information is simple</h3>
<div class="outline-text-3" id="text-4-8">
<p>
There isn't a problem with information. Information is simple. But we make it a problem! We hide it behind a micro language - a class. You make a Box class and you have to invent a whole language to manipulate boxes.
</p>

<p>
Start representing data as data
</p>

<p>
When we use classes we think we are encapsulating. Encapsulation is about hiding implementation detail. But information doesn't have implementation, it's just data. There is no innards of information. You added it. Why?
</p>

<p>
The information <i>will</i> eventually have representation - you don't get around that by wrapping it in a class, at some point someone is going to want to see the information a class contains.
</p>

<p>
The litmus test - can you move it?
</p>

<p>
Subsystems must have
</p>
<ul class="org-ul">
<li>well defined boundaries</li>
<li>absstracted operaitnal interface (verbs)</li>
<li>general error handling (checked exceptions are a terrible terrible idea)</li>
<li>take/return data (not IPersonInfo). Do this inside and outside systems</li>
</ul>
</div>
</div>

<div id="outline-container-org733c9e7" class="outline-3">
<h3 id="org733c9e7"><span class="section-number-3">4.9</span> Simplify during analysis, modelling, waaaay before you implement</h3>
</div>
</div>
<div id="outline-container-org91c94a9" class="outline-2">
<h2 id="org91c94a9"><span class="section-number-2">5</span> Simplicity is a choice</h2>
<div class="outline-text-2" id="text-5">
<p>
Nothing manfactures simplicity. It's a decision making process, and you have to do it over and over again, get better at it. Develop 'entanglement' intuition
</p>

<p>
Don't overestimate your reliability tools: they don't check for simplicity
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Joe</p>
<p class="date">Created: 2020-05-10 Sun 15:47</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
